tutorials/pM4F-Benchmarks/case8/unstructuredMesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          3;
        startFace       47581;
    }
    outlet
    {
        type            patch;
        nFaces          3;
        startFace       47584;
    }
    frontAndBack
    {
        type            empty;
        nFaces          63708;
        startFace       47587;
    }
    walls
    {
        type            patch;
        nFaces          394;
        startFace       111295;
    }
)

// ************************************************************************* //
