tutorials/pM4F-Benchmarks/case8/unstructuredMesh/0/Y.Charge
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Y.Charge;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
31854
(
-2.90572e-19
-2.90572e-19
-2.90572e-19
-2.90572e-19
-2.90572e-19
-2.90572e-19
-2.90572e-19
-2.90572e-19
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform -2.42433e-16;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
