tutorials/pM4F-Benchmarks/case8/unstructuredMesh/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
 {
  name selectedCells;
  type cellSet;
  action new;
  source boxToCell;
  sourceInfo
  {
   box (0.045 0. 0) (0.055 0.1 0.01);
  }
 }
);
